app/Controllers/Auth/PatientController.php

	public function login_action()
	{
		$validation = Services::validation();
		$validation->setRules([
			'emailAddress' => 'required|valid_email',
			'password' => 'required'
		]);

		if (!$this->validate($validation->getRules())) {
			return redirect()->back()->withInput()->with('errors', $validation->getErrors());
		}

		$patient = $this->patientModel->where('emailAddress', $this->request->getPost('emailAddress'))->first();
---
SELECT *
FROM `patient`
WHERE `emailAddress` = 'cyrilla.vanessa@gmail.com'
 LIMIT 1