app/Controllers/Admin/DoctorController.php

SELECT `doctor`.*, `specialization`.`title` as `specializationTitle`, `institution`.`name` as `institutionName`
FROM `doctor`
JOIN `specialization` ON `doctor`.`specializationId` = `specialization`.`specializationId`
JOIN `institution` ON `doctor`.`institutionId` = `institution`.`institutionId`
---
	public function index()
	{
		// Page Title
		$data['title'] = 'Registered Doctors';

		// Retrieve registered doctors
		$data['doctors'] = $this->doctorModel
				  ->join('specialization', 'doctor.specializationId = specialization.specializationId')
				  ->join('institution', 'doctor.institutionId = institution.institutionId')
				  ->select('doctor.*, specialization.title as specializationTitle, institution.name as institutionName')
				  ->findAll();