app/Controllers/Patient/AppointmentController.php

SELECT `doctor`.*, `institution`.`name` as `institutionName`, `specialization`.`title` as `specializationTitle`
FROM `doctor`
JOIN `institution` ON `doctor`.`institutionId` = `institution`.`institutionId`
JOIN `specialization` ON `doctor`.`specializationId` = `specialization`.`specializationId`
---
	public function searchDoctors()
	{
		// Fetch all doctors
        $doctors = $this->doctorModel
            ->join('institution', 'doctor.institutionId = institution.institutionId')
            ->join('specialization', 'doctor.specializationId = specialization.specializationId')
            ->select('doctor.*, institution.name as institutionName, specialization.title as specializationTitle')
            ->findAll();