doctors/app/Controllers/Doctor/AppointmentController.php

	public function view($appointmentId)
	{
		$appointment = $this->appointmentModel->find($appointmentId);

		if (!$appointment) {
			return redirect()->back()->with('error', 'Appointment not found.');
		}

		$data['patient'] = $this->patientModel->find($appointment['patientId']);
---
SELECT *
FROM `appointment`
WHERE `appointment`.`appointmentId` = '5'
SELECT *
FROM `patient`
WHERE `patient`.`patientId` = '1'

	public function approve($appointmentId)
	{
		$appointment = $this->appointmentModel->find($appointmentId);

		if (!$appointment) {
			return redirect()->back()->with('error', 'Appointment not found.');
		}

		$appointment['status'] = 'Approved';
		if ($this->appointmentModel->save($appointment)) {
---
SELECT *
FROM `appointment`
WHERE `appointment`.`appointmentId` = '5'
UPDATE `appointment` SET `patientId` = '1', `doctorId` = '1', `startTime` = '03:00:00', `endTime` = '04:00:00', `status` = 'Approved', `ratings` = '4', `review` = 'Nice', `doctorComments` = '', `summary` = '', `appointmentDate` = '2024-09-07'
WHERE `appointment`.`appointmentId` IN ('5')