doctors/app/Controllers/Auth/DoctorController.php

	public function register()
	{
		$data = [
			'title' => 'Register - Doctor',
			'specializations' => $this->specializationModel->findAll(),
			'institutions' => $this->institutionModel->findAll(),
---
SELECT *
FROM `specialization`
SELECT *
FROM `institution`

	public function login_action()
	{
		$validation = Services::validation();
		$validation->setRules([
			'emailAddress' => 'required|valid_email',
			'password' => 'required'
		]);

		if (!$this->validate($validation->getRules())) {
			$data = [
				'title' => 'Login - Doctor',
				'content' => view('doctor/login', ['errors' => $validation->getErrors()])
			];
			return view('templates/base', $data);
		}

		$doctor = $this->doctorModel->where('emailAddress', $this->request->getPost('emailAddress'))->first();
---
SELECT *
FROM `doctor`
WHERE `emailAddress` = 'michael.barasa@strathmore.edu'
 LIMIT 1