doctors/app/Controllers/Patient/AppointmentController.php

SELECT *
FROM `appointment`
WHERE `appointment`.`appointmentId` = '5'
SELECT *
FROM `doctor`
WHERE `doctor`.`doctorId` = '1'
---
	public function view($appointmentId)
	{
		$appointment = $this->appointmentModel->find($appointmentId);

		if (!$appointment) {
			return redirect()->back()->with('error', 'Appointment not found.');
		}

		$doctor = $this->doctorModel->find($appointment['doctorId']);

SELECT *
FROM `appointment`
WHERE `appointment`.`appointmentId` = '5'
UPDATE `appointment` SET `patientId` = '1', `doctorId` = '1', `startTime` = '03:00:00', `endTime` = '04:00:00', `status` = 'Pending', `ratings` = '4', `review` = '', `doctorComments` = '', `summary` = '', `appointmentDate` = '2024-09-07'
WHERE `appointment`.`appointmentId` IN ('5')
---
	public function rate($appointmentId)
	{
		$appointment = $this->appointmentModel->find($appointmentId);

		if (!$appointment) {
			return redirect()->back()->with('error', 'Appointment not found.');
		}

		$rating = $this->request->getPost('rating');
		$appointment['ratings'] = $rating;

		if ($this->appointmentModel->save($appointment)) {

SELECT *
FROM `appointment`
WHERE `appointment`.`appointmentId` = '5'
UPDATE `appointment` SET `patientId` = '1', `doctorId` = '1', `startTime` = '03:00:00', `endTime` = '04:00:00', `status` = 'Pending', `ratings` = '4', `review` = 'Nice', `doctorComments` = '', `summary` = '', `appointmentDate` = '2024-09-07'
WHERE `appointment`.`appointmentId` IN ('5')
---
	public function addReview($appointmentId)
	{
		$appointment = $this->appointmentModel->find($appointmentId);

		if (!$appointment) {
			return redirect()->back()->with('error', 'Appointment not found.');
		}

		$review = $this->request->getPost('review');
		$appointment['review'] = $review;

		if ($this->appointmentModel->save($appointment)) {