app/Models/AppointmentModel.php

SELECT *
FROM `appointment`
WHERE `patientId` = '1'
---
	public function getPatientAppointments($patientId)
    {
        return $this->where('patientId', $patientId)->findAll();

SELECT *
FROM `appointment`
WHERE `doctorId` = '1'
---
	public function getDoctorAppointments($doctorId)
    {
        return $this->where('doctorId', $doctorId)->findAll();