app/Models/RegionModel.php

SELECT *
FROM `region`
---
    public function getAllRegions()
    {
        return $this->findAll();