doctors/app/Models/AppointmentModel.php

	public function getPatientAppointments($patientId)
	{
		return $this->select('appointment.*, doctor.name as doctor_name, appointment.appointmentDate, appointment.startTime, appointment.endTime')
			  ->join('doctor', 'doctor.doctorId = appointment.doctorId')
			  ->where('appointment.patientId', $patientId)
			  ->findAll();
---
SELECT `appointment`.*, `doctor`.`name` as `doctor_name`, `appointment`.`appointmentDate`, `appointment`.`startTime`, `appointment`.`endTime`
FROM `appointment`
JOIN `doctor` ON `doctor`.`doctorId` = `appointment`.`doctorId`
WHERE `appointment`.`patientId` = '1'

	public function getDoctorAppointments($doctorId)
	{
		return $this->where('doctorId', $doctorId)->findAll();
---
SELECT *
FROM `appointment`
WHERE `doctorId` = '1'